In [1]:
import pandas as pd
import numpy as np
import psycopg2

In [3]:
conn = psycopg2.connect("dbname='cpdp' user='cpdp' host='localhost' password='postgres'")

In [90]:
officers_df = pd.read_sql('select * from data_officer', con=conn)
officers_df['first_name'] = officers_df['first_name'].str.lower()
officers_df['last_name'] = officers_df['last_name'].str.lower()
officers_df['middle_initial'] = officers_df['middle_initial'].str.lower()
officers_df['suffix_name'] = officers_df['suffix_name'].str.lower()

In [122]:
badge_df = pd.read_sql('SELECT * FROM data_officerbadgenumber WHERE current = true', con=conn)
badge_df['star'] = badge_df['star'].astype(float)

In [123]:
badge_df

          id     star  current  officer_id
0          2   1424.0     True           1
1          4  20373.0     True           2
2         10  18601.0     True           6
3         11  19596.0     True           7
4         20  17673.0     True          15
...      ...      ...      ...         ...
15359  43075  12191.0     True       33666
15360  43076  10280.0     True       33668
15361  43077   7341.0     True       33672
15362  43078  11238.0     True       33673
15363  43079  10348.0     True       33677

[15364 rows x 4 columns]

In [124]:
df = pd.read_csv('data/data_officerarrests_challengeII.csv')
df.dropna(inplace=True, how='all')
df.drop_duplicates(inplace=True)
df = df[df.id.notnull()]
df['first_name'] = df['first_name'].str.lower()
df['last_name'] = df['last_name'].str.lower()
df['middle_initial'] = df['middle_initial'].str.lower()
df['suffix_name'] = df['suffix_name'].str.lower()

df['star'] = df['star'].astype(object)

In [126]:
df.dropna(subset=['first_name', 'last_name'], how='all', inplace=True)

In [130]:
df

,last_name,first_name,middle_initial,appointed_date,suffix_name,cb_number,arrest_year,id,arrest_date,officer_role,star,arrest_id,officer_id
0,alexa,michelene,a,12/16/1991,NaN,14718114.0,2001,53937.0,NaN,NaN,NaN,NaN,312.0
1,alexa,michelene,a,12/16/1991,NaN,16626310.0,2006,1982434.0,NaN,NaN,NaN,1032115.0,312.0
2,alexa,michelene,a,12/16/1991,NaN,16008783.0,2004,1350436.0,NaN,NaN,NaN,738198.0,312.0
3,alexa,michelene,a,12/16/1991,NaN,17751668.0,2009,3076209.0,NaN,NaN,NaN,1746140.0,312.0
4,alexa,michelene,a,12/16/1991,NaN,19039938.0,2015,4309513.0,NaN,NaN,NaN,2469371.0,312.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4832661,williams,esther,s,12/22/1986,NaN,17483649.0,2009,2821414.0,NaN,NaN,NaN,1632233.0,30676.0
4832662,zanderson,milka,j,04/13/1987,NaN,15423304.0,2003,764162.0,NaN,NaN,NaN,560359.0,31548.0
4832663,zanderson,milka,j,04/13/1987,NaN,14951828.0,2001,302733.0,NaN,NaN,NaN,153394.0,31548.0
4832664,zanderson,milka,j,04/13/1987,NaN,15731694.0,2004,1067359.0,NaN,NaN,NaN,600509.0,31548.0
4832665,zanderson,milka,j,04/13/1987,NaN,16087636.0,2005,1432441.0,NaN,NaN,NaN,799953.0,31548.0

In [127]:
df.count()

last_name         4827911
first_name        4827911
middle_initial    3902451
appointed_date    4827880
suffix_name        212849
cb_number         4827911
arrest_year       4827911
id                4827911
arrest_date        180378
officer_role       180378
star               180378
arrest_id         4602862
officer_id        4652249
dtype: int64

In [141]:
((4652249) / 4827911) * 100

96.36153193379083

In [152]:
orphaned_officers = df[df['officer_id'].isnull()]

In [153]:
orphaned_officers

,last_name,first_name,middle_initial,appointed_date,suffix_name,cb_number,arrest_year,id,arrest_date,officer_role,star,arrest_id,officer_id
17676,o donnell,william,NaN,07/19/1982,NaN,16490922.0,2006,1840696.0,NaN,NaN,NaN,1017936.0,NaN
17677,o donnell,william,NaN,07/19/1982,NaN,16099516.0,2005,1444241.0,NaN,NaN,NaN,805291.0,NaN
21231,ruiz,mayra,NaN,12/15/2017,NaN,19673262.0,2018,4880013.0,07/14/2018,FIRST ARRESTING OFFICER,6126,NaN,NaN
21232,ruiz,mayra,NaN,12/15/2017,NaN,19673262.0,2018,4880013.0,07/14/2018,SECOND ARRESTING OFFICER,19490,NaN,NaN
31219,geisbush,gregory,NaN,10/18/1976,NaN,14737207.0,2001,73227.0,NaN,NaN,NaN,39665.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4822570,mccarthy,andrew,j,12/15/2017,NaN,19677664.0,2018,4884316.0,07/24/2018,FIRST ARRESTING OFFICER,14107,NaN,NaN
4822571,mccarthy,andrew,j,12/15/2017,NaN,19677664.0,2018,4884316.0,07/24/2018,SECOND ARRESTING OFFICER,6273,NaN,NaN
4822572,mccarthy,andrew,j,12/15/2017,NaN,19680642.0,2018,4887005.0,07/30/2018,FIRST ARRESTING OFFICER,14107,NaN,NaN
4822573,mccarthy,andrew,j,12/15/2017,NaN,19680642.0,2018,4887005.0,07/30/2018,SECOND ARRESTING OFFICER,5941,NaN,NaN
4822574,mccumby,kevin,e,04/01/1994,NaN,14870509.0,2001,215327.0,NaN,NaN,NaN,NaN,NaN

In [161]:
df_merged = pd.merge(orphaned_officers['first_name'], officers_df['first_name'], on='first_name')

In [162]:
df_merged

         first_name
0           william
1           william
2           william
3           william
4           william
...             ...
55282016     joshua
55282017     joshua
55282018     joshua
55282019     joshua
55282020     joshua

[55282021 rows x 1 columns]

In [155]:
orphaned_officers['first_name']

17676      william
17677      william
21231        mayra
21232        mayra
31219      gregory
            ...
4822570     andrew
4822571     andrew
4822572     andrew
4822573     andrew
4822574      kevin
Name: first_name, Length: 175662, dtype: object

In [159]:
orphaned_officers['first_name', 'last_name']

KeyError: ('first_name', 'last_name')